{
  "Tyrannosaurus": "Tyrannosaurus rex was one of the largest land predators ever known. It lived during the late Cretaceous period and could grow up to 40 feet long!",
  "Triceratops": "Triceratops was a large herbivorous dinosaur with three distinctive horns and a large bony frill. It lived during the late Cretaceous period.",
  "Stegosaurus": "Stegosaurus was a large, heavily built dinosaur with distinctive plates along its back and spikes on its tail for defense.",
  "Velociraptor": "Despite popular media portrayals, Velociraptors were actually about the size of a large turkey, but they were incredibly intelligent pack hunters.",
  "Brontosaurus": "Brontosaurus was a long-necked sauropod dinosaur that lived during the late Jurassic period. It could grow up to 72 feet long!",
  "Allosaurus": "Allosaurus was a large theropod dinosaur that lived during the late Jurassic period. It was a fearsome predator with powerful jaws and sharp teeth.",
  "Diplodocus": "Diplodocus was one of the longest dinosaurs ever discovered, with some specimens reaching over 90 feet in length.",
  "Parasaurolophus": "Parasaurolophus was a duck-billed dinosaur known for its distinctive hollow crest, which it used to make loud honking sounds.",
  "Ankylosaurus": "Ankylosaurus was heavily armored with bony plates and spikes, and had a massive club at the end of its tail for defense.",
  "Spinosaurus": "Spinosaurus was a massive semi-aquatic dinosaur with a distinctive sail on its back and crocodile-like snout for catching fish.",
  "Carnotaurus": "Carnotaurus was a fast-running predator with distinctive horns above its eyes and tiny, almost useless arms.",
  "Iguanodon": "Iguanodon was one of the first dinosaurs ever discovered and was a large herbivore with distinctive thumb spikes.",
  "Compsognathus": "Compsognathus was one of the smallest known dinosaurs, about the size of a chicken, and was a swift predator.",
  "Archaeopteryx": "Archaeopteryx is considered the missing link between dinosaurs and birds, with both feathers and teeth.",
  "Giganotosaurus": "Giganotosaurus was one of the largest land predators ever, potentially even larger than T-rex."
}